tap "felixkratz/formulae"
tap "filosottile/musl-cross"
tap "go-swagger/go-swagger"
tap "grafana/grafana"
tap "homebrew/services"
tap "libsql/sqld"
tap "messense/macos-cross-toolchains"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "riscv/riscv"
tap "tursodatabase/tap"
tap "withgraphite/tap"
brew "python@3.13"
brew "asciinema"
brew "atuin"
brew "awscli"
brew "bat"
brew "binutils"
brew "buildkit"
brew "libpng"
brew "glib"
brew "pixman"
brew "capstone"
brew "carapace"
brew "cmake"
brew "cmatrix"
brew "gmp"
brew "coreutils"
brew "dbmate"
brew "diff-so-fancy"
brew "docker-compose"
brew "eksctl"
brew "expat"
brew "eza"
brew "fd"
brew "flock"
brew "fzf"
brew "mpfr"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "geni"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "gnutls"
brew "libusb"
brew "go"
brew "pkgconf"
brew "helm"
brew "jpeg"
brew "jpeg-turbo"
brew "jq"
brew "kind"
brew "lazydocker"
brew "lazygit"
brew "ledger"
brew "libelf"
brew "libmpdclient"
brew "libslirp"
brew "libssh"
brew "lima"
brew "make"
brew "md5sha1sum"
brew "mongosh"
brew "neovim"
brew "ninja"
brew "nushell"
brew "nvm"
brew "tree"
brew "pass"
brew "pinentry-mac"
brew "pipx"
brew "pnpm"
brew "postgresql@16"
brew "protobuf"
brew "python-setuptools"
brew "r"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "riscv64-elf-binutils"
brew "riscv64-elf-gcc"
brew "riscv64-elf-gdb"
brew "skaffold"
brew "starship"
brew "terraform"
brew "texinfo"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "wakatime-cli"
brew "wget"
brew "when"
brew "yarn"
brew "yazi"
brew "zig"
brew "zlib"
brew "zoxide"
brew "felixkratz/formulae/sketchybar"
brew "filosottile/musl-cross/musl-cross"
brew "go-swagger/go-swagger/go-swagger"
brew "messense/macos-cross-toolchains/aarch64-unknown-linux-gnu"
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
brew "oven-sh/bun/bun"
brew "riscv/riscv/riscv-gnu-toolchain"
brew "riscv/riscv/riscv-tools"
brew "tursodatabase/tap/turso"
brew "withgraphite/tap/graphite"
cask "aerospace"
cask "alacritty"
cask "betterdisplay"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "gimp@dev"
cask "miniconda"
cask "rstudio"
cask "stats"
cask "ungoogled-chromium"
cask "wezterm"
cask "zed"
